import './Footer.scss';
const Footer = () => {
  return (
    <footer className="page-footer">
      <div className="container-small">
        <div className="footer level1">
          <div className="footer-categories-pages">
            {' '}
            <ul className="footer-categories-links">
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/sushi/sushi.html">Суші</a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/sushi/rolly.html">Роли</a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/pizza-italiani.html">Піца</a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/pizza-italiani/party-picca.html">
                  Party піца
                </a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/osoboe.html">Від Шефа</a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/catalog/salaty.html">Салати</a>
              </li>
            </ul>
            <ul className="footer-cms-pages-links"></ul>
          </div>
          <div className="footer-pages">
            {' '}
            <ul className="footer-cms-pages-links">
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/informacija-dlja-budujuschih-partnerov">
                  Інформація для майбутніх партнерів
                </a>
              </li>
              <li className="">
                <a href="https://www.yaposhka.kh.ua/ua/restaurant">Ресторани</a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/blog/novosti">Новини</a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/blog/specpredlozhenija-i-akcii">Акції</a>
              </li>
              <li className="mobi-hide">
                <a href="https://www.yaposhka.kh.ua/ua/bonus-program">Бонуси</a>
              </li>
              <li>
                <a href="https://www.yaposhka.kh.ua/ua/blog/vakansii">Вакансії</a>
              </li>
            </ul>
          </div>
          <div className="footer-contact-info">
            {' '}
            <div className="contact-phone-list">
              <ul>
                <li>
                  <a href="tel:Телефони для замовлень:">Телефони для замовлень:</a>
                </li>
                <li>
                  <a href="tel:(096) 336 47 47">(096) 336 47 47</a>
                </li>
                <li>
                  <a href="tel:(063) 837 47 47">(063) 837 47 47</a>
                </li>
                <li>
                  <a href="tel:(057) 758 99 47">(057) 758 99 47</a>
                </li>
                <li>
                  <a href="tel:(099)367 47 47">(099)367 47 47</a>
                </li>
              </ul>{' '}
            </div>
            <div className="contact-email">info@yaposhka.com.ua </div>
            <div className="contact-phone">
              <span>Цілодобовий телефон для скарг та пропозицій</span>
              (099) 555 58 40{' '}
            </div>
          </div>
        </div>{' '}
        <div className="mobile-suggests-phone">
          <span>Цілодобовий телефон для скарг та пропозицій</span>
          (099) 555 58 40{' '}
        </div>
        <div className="footer level2">
          {' '}
          <div className="social-accounts">
            <ul>
              <li className="icon-block">
                <a href="https://www.facebook.com/yaposhka.kharkiv" target="_blank">
                  <svg
                    version="1.1"
                    id="Capa_1"
                    xmlns="http://www.w3.org/2000/svg"
                    xmlnsXlink="http://www.w3.org/1999/xlink"
                    x="0px"
                    y="0px"
                    viewBox="0 0 29.94 29.94"
                    xmlSpace="preserve"
                  >
                    <g>
                      <path
                        d="M27.56,0.684H2.383C1.065,0.684,0,1.748,0,3.064v23.813c0,1.312,1.065,2.379,2.383,2.379H27.56
		c1.312,0,2.38-1.066,2.38-2.379V3.064C29.939,1.748,28.871,0.684,27.56,0.684z M20.125,9.167c-0.619-0.362-1.11-0.648-1.727-0.648
		c-0.604,0-1.12,0.151-1.384,0.405c-0.264,0.252-0.395,0.74-0.395,1.461v1.067h3.229l-0.699,2.968h-2.53v9.862h-4.056V14.42H10.67
		v-2.968h1.895v-1.133c0-1.193,0.143-1.907,0.425-2.496c0.281-0.587,0.826-1.241,1.584-1.611c0.757-0.369,1.877-0.555,3.036-0.555
		c1.188,0,2.116,0.396,3.254,0.715L20.125,9.167z"
                      />
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                      <g></g>
                    </g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                  </svg>
                </a>
              </li>
              <li className="icon-block">
                <a href="https://www.instagram.com/yaposhka.kharkiv/" target="_blank">
                  <svg
                    version="1.1"
                    id="Layer_1"
                    xmlns="http://www.w3.org/2000/svg"
                    xmlnsXlink="http://www.w3.org/1999/xlink"
                    x="0px"
                    y="0px"
                    viewBox="0 0 300 300"
                    xmlSpace="preserve"
                  >
                    <g id="XMLID_504_">
                      <path
                        id="XMLID_505_"
                        d="M38.52,0.012h222.978C282.682,0.012,300,17.336,300,38.52v222.978c0,21.178-17.318,38.49-38.502,38.49
		H38.52c-21.184,0-38.52-17.313-38.52-38.49V38.52C0,17.336,17.336,0.012,38.52,0.012z M218.546,33.329
		c-7.438,0-13.505,6.091-13.505,13.525v32.314c0,7.437,6.067,13.514,13.505,13.514h33.903c7.426,0,13.506-6.077,13.506-13.514
		V46.854c0-7.434-6.08-13.525-13.506-13.525H218.546z M266.084,126.868h-26.396c2.503,8.175,3.86,16.796,3.86,25.759
		c0,49.882-41.766,90.34-93.266,90.34c-51.487,0-93.254-40.458-93.254-90.34c0-8.963,1.37-17.584,3.861-25.759H33.35v126.732
		c0,6.563,5.359,11.902,11.916,11.902h208.907c6.563,0,11.911-5.339,11.911-11.902V126.868z M150.283,90.978
		c-33.26,0-60.24,26.128-60.24,58.388c0,32.227,26.98,58.375,60.24,58.375c33.278,0,60.259-26.148,60.259-58.375
		C210.542,117.105,183.561,90.978,150.283,90.978z"
                      />
                    </g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                  </svg>
                </a>
              </li>
              <li className="icon-block">
                <a href="https://tinyurl.com/ycyhwka6" target="_blank">
                  <svg
                    version="1.1"
                    id="Capa_1"
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    viewBox="0 0 52.511 52.511"
                  >
                    <g>
                      <g>
                        <path
                          d="M31.256,0H21.254C10.778,0,2.255,8.521,2.255,18.995v9.01c0,7.8,4.793,14.81,12,17.665v5.841
			c0,0.396,0.233,0.754,0.595,0.914c0.13,0.058,0.268,0.086,0.405,0.086c0.243,0,0.484-0.089,0.671-0.259L21.725,47h9.531
			c10.476,0,18.999-8.521,18.999-18.995v-9.01C50.255,8.521,41.732,0,31.256,0z M48.255,28.005C48.255,37.376,40.63,45,31.256,45
			h-9.917c-0.248,0-0.487,0.092-0.671,0.259l-4.413,3.997v-4.279c0-0.424-0.267-0.802-0.667-0.942
			C8.81,41.638,4.255,35.196,4.255,28.005v-9.01C4.255,9.624,11.881,2,21.254,2h10.002c9.374,0,16.999,7.624,16.999,16.995V28.005z"
                        />
                        <path
                          d="M39.471,30.493l-6.146-3.992c-0.672-0.437-1.472-0.585-2.255-0.423c-0.784,0.165-1.458,0.628-1.895,1.303l-0.289,0.444
			c-2.66-0.879-5.593-2.002-7.349-7.085l0.727-0.632h0c1.248-1.085,1.379-2.983,0.294-4.233l-4.808-5.531
			c-0.362-0.417-0.994-0.46-1.411-0.099l-3.019,2.624c-2.648,2.302-1.411,5.707-1.004,6.826c0.018,0.05,0.04,0.098,0.066,0.145
			c0.105,0.188,2.612,4.662,6.661,8.786c4.065,4.141,11.404,7.965,11.629,8.076c0.838,0.544,1.781,0.805,2.714,0.805
			c1.638,0,3.244-0.803,4.202-2.275l2.178-3.354C40.066,31.413,39.934,30.794,39.471,30.493z M35.91,34.142
			c-0.901,1.388-2.763,1.782-4.233,0.834c-0.073-0.038-7.364-3.835-11.207-7.75c-3.592-3.659-5.977-7.724-6.302-8.291
			c-0.792-2.221-0.652-3.586,0.464-4.556l2.265-1.968l4.152,4.776c0.369,0.424,0.326,1.044-0.096,1.411l-1.227,1.066
			c-0.299,0.26-0.417,0.671-0.3,1.049c2.092,6.798,6.16,8.133,9.13,9.108l0.433,0.143c0.433,0.146,0.907-0.021,1.155-0.403
			l0.709-1.092c0.146-0.226,0.37-0.379,0.63-0.434c0.261-0.056,0.527-0.004,0.753,0.143l5.308,3.447L35.91,34.142z"
                        />
                        <path
                          d="M28.538,16.247c-0.532-0.153-1.085,0.156-1.236,0.688c-0.151,0.531,0.157,1.084,0.688,1.235
			c1.49,0.424,2.677,1.613,3.097,3.104c0.124,0.44,0.525,0.729,0.962,0.729c0.09,0,0.181-0.012,0.272-0.037
			c0.531-0.15,0.841-0.702,0.691-1.234C32.405,18.578,30.69,16.859,28.538,16.247z"
                        />
                        <path
                          d="M36.148,22.219c0.09,0,0.181-0.012,0.272-0.037c0.532-0.15,0.841-0.703,0.691-1.234c-1.18-4.183-4.509-7.519-8.689-8.709
			c-0.531-0.153-1.084,0.158-1.235,0.689c-0.151,0.531,0.157,1.084,0.688,1.235c3.517,1,6.318,3.809,7.311,7.328
			C35.311,21.931,35.711,22.219,36.148,22.219z"
                        />
                        <path
                          d="M27.991,7.582c-0.532-0.153-1.085,0.156-1.236,0.689c-0.151,0.531,0.157,1.084,0.688,1.235
			c5.959,1.695,10.706,6.453,12.388,12.416c0.124,0.44,0.525,0.729,0.962,0.729c0.09,0,0.181-0.012,0.272-0.037
			c0.531-0.15,0.841-0.703,0.691-1.234C39.887,14.753,34.613,9.467,27.991,7.582z"
                        />
                      </g>
                    </g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                  </svg>
                </a>
              </li>
              <li className="icon-block">
                <a href="https://www.youtube.com/channel/UCnrqziQ4R4_iVZKDqTpLgmA" target="_blank">
                  <svg
                    width="32px"
                    height="32px"
                    viewBox="0 0 32 32"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path d="M16.708 0.027c1.745-0.027 3.48-0.011 5.213-0.027 0.105 2.041 0.839 4.12 2.333 5.563 1.491 1.479 3.6 2.156 5.652 2.385v5.369c-1.923-0.063-3.855-0.463-5.6-1.291-0.76-0.344-1.468-0.787-2.161-1.24-0.009 3.896 0.016 7.787-0.025 11.667-0.104 1.864-0.719 3.719-1.803 5.255-1.744 2.557-4.771 4.224-7.88 4.276-1.907 0.109-3.812-0.411-5.437-1.369-2.693-1.588-4.588-4.495-4.864-7.615-0.032-0.667-0.043-1.333-0.016-1.984 0.24-2.537 1.495-4.964 3.443-6.615 2.208-1.923 5.301-2.839 8.197-2.297 0.027 1.975-0.052 3.948-0.052 5.923-1.323-0.428-2.869-0.308-4.025 0.495-0.844 0.547-1.485 1.385-1.819 2.333-0.276 0.676-0.197 1.427-0.181 2.145 0.317 2.188 2.421 4.027 4.667 3.828 1.489-0.016 2.916-0.88 3.692-2.145 0.251-0.443 0.532-0.896 0.547-1.417 0.131-2.385 0.079-4.76 0.095-7.145 0.011-5.375-0.016-10.735 0.025-16.093z" />
                  </svg>
                </a>
              </li>
              <li className="icon-block">
                <a href="https://www.tiktok.com/@yaposhka.official" target="_blank">
                  <svg
                    version="1.1"
                    id="Capa_1"
                    xmlns="http://www.w3.org/2000/svg"
                    x="0px"
                    y="0px"
                    viewBox="0 0 209.673 209.673"
                    xmlSpace="preserve"
                  >
                    <g>
                      <path
                        d="M173.075,29.203H36.599C16.418,29.203,0,45.626,0,65.812v78.05c0,20.186,16.418,36.608,36.599,36.608h136.477
		c20.18,0,36.598-16.422,36.598-36.608v-78.05C209.673,45.626,193.255,29.203,173.075,29.203z M194.673,143.861
		c0,11.915-9.689,21.608-21.598,21.608H36.599c-11.91,0-21.599-9.693-21.599-21.608v-78.05c0-11.915,9.689-21.608,21.599-21.608
		h136.477c11.909,0,21.598,9.693,21.598,21.608V143.861z"
                      />
                      <path
                        d="M145.095,98.57L89.499,61.92c-2.303-1.519-5.254-1.649-7.684-0.342c-2.429,1.308-3.944,3.845-3.944,6.604v73.309
		c0,2.759,1.515,5.295,3.944,6.604c1.113,0.6,2.336,0.896,3.555,0.896c1.442,0,2.881-0.415,4.129-1.239l55.596-36.659
		c2.105-1.388,3.372-3.74,3.372-6.262C148.467,102.31,147.2,99.958,145.095,98.57z M92.871,127.562V82.109l34.471,22.723
		L92.871,127.562z"
                      />
                    </g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                    <g></g>
                  </svg>
                </a>
              </li>{' '}
            </ul>
          </div>
          <div>
            <img
              src="https://www.yaposhka.kh.ua/media/shop/cache/171x42/default/payment_info.png"
              alt="cache"
            ></img>
          </div>
          <a id="complain_form_pop" href="#complain-body2"></a>
          <div>
            <a href="#complain-body" className="btn wayra wayra-grey btn-complain">
              <span className="wayra-inner">Надіслати</span>
            </a>
          </div>
        </div>
        <div className="footer level3">
          <span className="privacy-policy">
            Політика конфіденційності{' '}
            <a href="https://www.yaposhka.kh.ua/policy/Privacy_Policy_of_Yaposhka_rus.html">RUS</a>{' '}
            <a href="https://www.yaposhka.kh.ua/policy/Privacy_Policy_of_Yaposhka_ukr.html">UA</a>{' '}
            <a href="https://www.yaposhka.kh.ua/policy/Privacy_Policy_of_Yaposhka_eng.html">ENG</a>
          </span>{' '}
          <div className="copyright-content">
            ©«Будь-яке використання чи копіювання матеріалів або добірок матеріалів сайту, елементів
            дизайну та оформлення заборонено».{' '}
          </div>
          <small className="copyright">
            <span>© Япошка 2011-2022</span>
          </small>
          <span className="development-by">
            Розроблено в{' '}
            <a href="https://brander.ua/" target="_blank">
              Brander
            </a>
          </span>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
